Revit 2026 API

# FaceIntersectionFaceResult Enumeration

---

An enumerated type listing the possible results of a face-face intersection calculation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FaceIntersectionFaceResult
```
```vb
Public Enumeration FaceIntersectionFaceResult
```
```cpp
public enum class FaceIntersectionFaceResult
```
```fsharp
type FaceIntersectionFaceResult
```

| Member name | Value | Description |
| --- | --- | --- |
| Intersecting | 0 | The two faces have an intersection. |
| NonIntersecting | 1 | The two faces have no intersection. |

#### Reference

Autodesk.Revit.DB Namespace